\ne
( most of these are from proofwiki.org )
- power set :: X \times Y = { (x, y) : x \in X \land y \in Y }.
- extensionality :: \forall{}A ∀B (∀X, (X \in A ⇔ X \in B) \Rightarrow A = B).
- pairing :: ∀A ∀B ∃x ∀y (y∈x ⇔ y=A ∨ y=B).
- infinity :: ∃x ((∃y y∈x ∧ ∀z ¬ (z∈y)) ∧ ∀u u∈x ⇒ u⁺∈x)
- union :: ∀A.∃x.∀y.(y∈x ⇔ ∃z. (z∈A ∧ y∈z))
- foundation :: ∀S.((∃x.x∈S) ⇒ ∃y∈S. ∀z∈S. ¬(z∈y))
- existence :: ∃x.∀y.(¬(y∈x))
- choice :: ∀s.((∅∉s ∧ ∀t,u∈s.t=u ∨ t∩u=∅) ⇒ ∃c.∀t∈s.∃x.t∩c={x})
- specification :: ∀P:a → Bit. ∀z.∃x.∀y.(y∈x ⇒ (y∈z ∧ P(y)))
- replacement :: (∀y.∃x.∀z.(P(y,z)⇒x=z))⇒∀w.∃x.∀y.(y∈w⇒∀z.(P(y,z)⇒z∈x))

# this one comes from http://us.metamath.org/mpeuni/ax-groth.html
- tarski :: ⊢ ∃y(x∈y ∧ ∀z∈y (∀w(w ⊆ z → w ∈ y) ∧ ∃w∈y ∀v(v ⊆ z → v ∈ w)) ∧ ∀z(z ⊆ y → (z ≈ y ∨ z ∈ y)))

#+begin_src J
,.a. i. L: 0 '∀';'∈';'⇔';'∧';'∪';'∩';'⊃';'⊂'
#+end_src
#+RESULTS:
#+begin_example
┌───────────┐
│226 136 128│
├───────────┤
│226 136 136│
├───────────┤
│226 135 148│
├───────────┤
│226 136 167│
├───────────┤
│226 136 170│
├───────────┤
│226 136 169│
├───────────┤
│226 138 131│
├───────────┤
│226 138 130│
└───────────┘
#+end_example

